Revit 2024 API
WallType.Kind Property
 The nature of the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WallKind Kind { get; }
Visual Basic
Public ReadOnly Property Kind As WallKind
	Get
Visual C++
public:
property WallKind Kind {
	WallKind get ();
}
See Also
WallType Class
Autodesk.Revit.DB Namespace